# Напишите программу, удаляющую из текста все слова, содержащие ""абв"".

some_text = input()
print(some_text.replace('абв', ''))
